irvynX/ESP32/controladorCuarto/src/main.cpp
                            <input type="radio" class="btn-check" name="efecto" value="1" id="btnradio9" autocomplete="off" )====";
// ------------------------- si el efecto es 1 agregamos checked
const String pagina16 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio9">MUSICA 1</label>

                            <input type="radio" class="btn-check" name="efecto" value="2" id="btnradio10" autocomplete="off" )====";
// -------------------------- si el efecto es 2 agregamos checked
const String pagina17 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio10">MUSICA 2</label>

                            <input type="radio" class="btn-check" name="efecto" value="3" id="btnradio11" autocomplete="off" )====";
// -------------------------- si el efcto es 3 agregamos checked
const String pagina18 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio11">RECORRER TIRA</label>

                            <input type="radio" class="btn-check" name="efecto" value="4" id="btnradio12" autocomplete="off" )====";
// -------------------------- si el efcto es 4 agregamos checked
const String pagina19 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio12">RESPIRAR</label>
                        </div>
                        <div class="mb-4">
                            <h3>COLOR</h3>
                            <input type="color" class="form-control form-control-color m-auto" value=")====";
// -------------------------- valor en hexadecimal del color
const String pagina20 = R"====(" title="Choose your color" name="color">
                        </div>
                        <br>
                        <br>
                        <h3>BRILLO</h3>
                        <div class="mb-4">
                            <input type="range" class="form-range w-50 p-3" min="0" max="255" step="5" id="customRange3" name="brillo" value=")====";
// -------------------------- brillo de la tira led
const String pagina21 = R"====(">
                        </div>
                        <br>
                        <input type="submit" value="enviar" class="btn btn-outline-info">
                    </div>
                </form>
                <br>
                <HR>
                <form action="" method="get" class="text-center">
                    <h1> MICROFONO Y HORA </h1>
                    <div class="mb-4">
                        <h3>MULTIPLICADOR DEL MICROFONO</h3>
                        <input type="number" class="form-control w-25 m-auto" name="micro" value=")====";
// -------------------------- multiplicador del mucrofono
const String pagina22 = R"====(">
                    </div>
                    <div class="mb-4">
                        <h3>AUMENTAR O DISMINUIR</h3>
                        <div class="w-25 m-auto">
                            <div class="input-group mb-3">
                                <input type="number" class="form-control w-50 m-auto" placeholder="HH"  name="hora" min="-24" max="24" value=")====";
// -------------------------- hora que se va a sumar o restar al reloj
const String pagina23 = R"====(">
                                <input type="number" class="form-control w-50 m-auto" placeholder="MM" name="minuto" min="-60" max="60" value=")====";
// ------------------------- minutos que se va a sumar o restar al reloj
const String pagina24 = R"====(">
                            </div>                          
                        </div>
                    </div>
                    <br>
                    <input type="submit" value="enviar" class="btn btn-outline-info">
                </form>
            </div>
        </div>
    </div>
</body>
</html>)====";

const uint32_t TiempoEsperaWifi = 5000;

unsigned long TiempoActual = 0;
unsigned long TiempoAnterior = 0;
const long TiempoCancelacion = 500;

WiFiServer servidor(80);

// globales
// numero de leds
const int numLeds = 30;
// tira gabinete
int tira1 = 18;
// tira escritorio
int tira2 = 19;
// microfono
int microfono = 34;
// rele
int rele = 5;
// boton 1
int boton1 = 32;
// boton 2
int boton2 = 33;
// boton 3
int boton3 = 27;
// boton 4
int boton4 = 14;
// boton 5
int boton5 = 12;
// boton 6
int boton6 = 13;
// Definir el número de pin del botón táctil
int boton7 = 15;

// variables para las tiras led
// cada estado indica el efecto
//       0 = apagado
//       1 = encendido
//       2 = musica
//       3 = musica 2
//       4 = recorrer tira
//       5 = encender y apagar
int estadoG = 0;
int estadoE = 0;
int encenderG = 1;
int encenderE = 1;
// color de la tira
int rojoG = 255;
int verdeG = 0;
int azulG = 0;
int brilloG = 255;
int rojoE = 255;
int verdeE = 0;
int azulE = 0;
int brilloE = 255;

// sencibilidaddel microfono
int mulMicrofono = 0;

// variables para el rele
int estadoRele = 0;
// variables para efectode musica 1
int encenderLeds = 0;
int tiempoActualMusica = 0;
int tiempoPrevioMusica = 0;
int intervaloMusica = 50;
int luces[numLeds];
// variables para llenar tira
int tiempoActualLlenar = 0;
int tiempoPrevioLlenar = 0;
int intervaloLlenar = 50;
int ledLlenar = 0;
// variables para respirar
int tiempoActualRes = 0;
int tiempoPrevioRes = 0;
int intervaloRes = 10;
int brillo = 0;
bool respirar = true;
// variables de la pagina
String valorHexa = "#FF0000";
int rojoTemp = 255;
int verdeTemp = 0;
int azulTemp = 0;

// variables para hora
int horaSumar = 0;
int minSumar = 0;

// pratiras led
#include <Adafruit_NeoPixel.h>
#include <FastLED.h>

// gabinete
Adafruit_NeoPixel pixelsG(numLeds, tira1, NEO_GRB + NEO_KHZ800);
// escritorio
Adafruit_NeoPixel pixelsE(numLeds, tira2, NEO_GRB + NEO_KHZ800);

void setup()
{
  // wifi
  Serial.begin(115200);
  Serial.println("\nIniciando Wifi");

  wifiMulti.addAP("Totalplay-2DA1-2", "irvyn2703");

  WiFi.mode(WIFI_STA);
  Serial.print("Conectando a Wifi ..");
  while (wifiMulti.run(TiempoEsperaWifi) != WL_CONNECTED)
  {
  }
  Serial.println(".. Conectado");
  Serial.print("SSID:");
  Serial.print(WiFi.SSID());
  Serial.print(" ID:");
  Serial.println(WiFi.localIP());

  servidor.begin();

  MDNS.addService("http", "tcp", 80);

  // preparar entradas
  pinMode(microfono, INPUT);
  pinMode(rele, OUTPUT);
  pinMode(boton1, INPUT);
  pinMode(boton2, INPUT);
  pinMode(boton3, INPUT);
  pinMode(boton4, INPUT);
  pinMode(boton5, INPUT);
  pinMode(boton6, INPUT);
  pinMode(boton7, INPUT);

